arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.h
__attribute__((used)) static bool compFunc(uint32_t i, uint32_t j)
{
  return (i > j);
}

class ReadStatus
{
public:
  ReadStatus();
  ~ReadStatus();
  String status();
  String info();
  bool success();
  void empty();
  friend IMAPData;

  std::string _status = "";
  std::string _info = "";
  bool _success = false;
};

class SendStatus
{
public:
  SendStatus();
  ~SendStatus();
  String info();
  bool success();
  void empty();
  friend SMTPData;

  std::string _info = "";
  bool _success = false;
};

typedef void (*readStatusCallback)(ReadStatus);
typedef void (*sendStatusCallback)(SendStatus);



class ESP32_MailClient
{

public:
  /*

    Sending Email through SMTP server

    @param net - HTTPClientESP32 WiFi client.

    @return Boolean type status indicates the success of operation.

  */
  bool sendMail(SMTPData &smtpData);

  /*

    Reading Email through IMAP server.

    @param imapData - IMAP Data object to hold data and instances.

    @return Boolean type status indicates the success of operation.

  */
  bool readMail(IMAPData &imapData);

  /*

    Set the argument to the Flags for message.

    @param imapData - IMAP Data object to hold data and instances.

    @param msgUID - The UID of message.

    @param flags - The flag list.


    @return Boolean type status indicates the success of operation.

  */
  bool setFlag(IMAPData &imapData, int msgUID, const String &flags);



  /*

    Add the argument to the Flags for message.

    @param imapData - IMAP Data object to hold data and instances.

    @param msgUID - The UID of message.

    @param flags - The flag list.


    @return Boolean type status indicates the success of operation.

  */
  bool addFlag(IMAPData &imapData, int msgUID, const String &flags);

  /*

    Remove the argument from the Flags for message.

    @param imapData - IMAP Data object to hold data and instances.

    @param msgUID - The UID of message.

    @param flags - The flag list.


    @return Boolean type status indicates the success of operation.

  */
  bool removeFlag(IMAPData &imapData, int msgUID, const String &flags);

  /*

    Get the Email sending error details.

    @return Error details string (String object).

  */
  String smtpErrorReason();

  /*

    Get the Email reading error details.

    @return Error details string (String object).

  */
  String imapErrorReason();

  /*

    Init SD card with GPIO pins.

    @param sck -  SPI Clock pin.
    @param miso - SPI MISO pin.
    @param mosi - SPI MOSI pin.
    @param ss -   SPI Chip/Slave Select pin.

    @return Boolean type status indicates the success of operation.

  */
  bool sdBegin(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t ss);

  /*

    Init SD card with default GPIO pins.

    @return Boolean type status indicates the success of operation.

  */
  bool sdBegin(void);

  struct IMAP_COMMAND_TYPE;
  struct IMAP_HEADER_TYPE;


ESP32TimeHelper Time;

private:
  int _smtpStatus = 0;
  int _imapStatus = 0;
  bool _sdOk = false;
  bool _sdConfigSet = false;
  uint8_t _sck, _miso, _mosi, _ss;
  unsigned long _lastReconnectMillis = 0;
  uint16_t _reconnectTimeout = 10000;


  std::string smtpErrorReasonStr();
  std::string imapErrorReasonStr();
  void ESP32MailDebugError();
  void ESP32MailDebugInfo(PGM_P info);
  void set_message_header(string &header, std::string &message, bool htmlFormat);
  void set_attachment_header(uint8_t index, std::string &header, attachmentData &attach);
  void clientReadAll(WiFiClient *client);
  double base64DecodeSize(std::string lastBase64String, int length);
  unsigned char *base64_decode_char(const unsigned char *src, size_t len, size_t *out_len);
  std::string base64_encode_string(const unsigned char *src, size_t len);
  void send_base64_encode_mime_data(WiFiClient *client, const unsigned char *src, size_t len);
  void send_base64_encode_mime_file(WiFiClient *client, File file);
  int waitSMTPResponse(SMTPData &smtpData);
  bool waitIMAPResponse(IMAPData &imapData, uint8_t imapCommandType = 0, int maxChar = 0, int mailIndex = -1, int messageDataIndex = -1, std ::string part = "");
  bool _setFlag(IMAPData &imapData, int msgUID, const String &flags, uint8_t action);
  bool getIMAPResponse(IMAPData &imapData);
  void createDirs(std::string dirs);
  bool smtpClientAvailable(SMTPData &smtpData, bool available);
  bool imapClientAvailable(IMAPData &imapData, bool available);
  bool sdTest();
};

class messageBodyData
{
public:
  messageBodyData();
  ~messageBodyData();
  void empty();

  friend ESP32_MailClient;
  friend IMAPData;

protected:
  uint8_t _index = 0;
  size_t _size = 0;
  std::string _text = "";
  std::string _filename = "";
  std::string _savePath = "";
  std::string _name = "";
  std::string _disposition = "";
  std::string _contentType = "";
  std::string _descr = "";
  std::string _transfer_encoding = "";
  std::string _creation_date = "";
  std::string _modification_date = "";
  std::string _charset = "";
  std::string _part = "";
  std::string _downloadError = "";
  bool _sdFileOpenWrite = false;
  bool _error = false;
};

class attachmentData
{
public:
  attachmentData();
  ~attachmentData();

  friend ESP32_MailClient;
  friend SMTPData;

protected:
  uint8_t _index = 0;
  std::vector<std::vector<uint8_t *>> _buf = std::vector<std::vector<uint8_t *>>();
  std::vector<std::string> _filename = std::vector<std::string>();
  std::vector<uint8_t> _id = std::vector<uint8_t>();
  std::vector<uint8_t> _type = std::vector<uint8_t>();
  std::vector<size_t> _size = std::vector<size_t>();
  std::vector<std::string> _mime_type = std::vector<std::string>();

  void add(const String &fileName, const String &mimeType, uint8_t *data, size_t size);
  void remove(uint8_t index);
  void free();
  String getFileName(uint8_t index);
  String getMimeType(uint8_t index);
  uint8_t *getData(uint8_t index);
  uint16_t getSize(uint8_t index);
  uint8_t getCount();
  uint8_t getType(uint8_t index);
};

class IMAPData
{
public:
  IMAPData();
  ~IMAPData();

