arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.h
  /*

    Set storage type to save download attached file or messages.

    @param storageType - The storage type to save file, MailClientStorageType::SD or MailClientStorageType::SPIFFS

  */
  void setFileStorageType(uint8_t storageType);

  /*

    Enable/disable attachment download.

    @param download - Boolean flag to enable/disable attachment download.

  */
  void setDownloadAttachment(bool download);

  /*

    Enable/disable html message result.

    @param htmlFormat - Boolean flag to enable/disable html message result.

    The default value is false.

  */
  void setHTMLMessage(bool htmlFormat);

  /*

    Enable/disable plain text message result.

    @param textFormat - Boolean flag to enable/disable plain text message result.

    The default value is true.

  */
  void setTextMessage(bool textFormat);

  /*

    Set the maximum message to search.

    @param limit - Any number from 0 to 65535.

    The default value is 20.

  */
  void setSearchLimit(uint16_t limit);

  /*

    Enable/disable recent sort result.

    @param recentSort - Boolean flag to enable/disable recent message sort result.

     The default value is true.

   */
  void setRecentSort(bool recentSort);

  /*

    Assign callback function that return status of message fetching or reading.

    @param readCallback - The function that accept readStatusCallback as parameter.

  */
  void setReadCallback(readStatusCallback readCallback);

  /*

    Enable/disable attachement download progress while fetching or receiving message.

    @param report - Boolean flag to enable/disable attachement download progress while fetching or receiving message.

    To get the download status, Callback function should be set through setReadCallback.

  */
  void setDownloadReport(bool report);

  /*

    Determine only message header is return when search.

  */
  bool isHeaderOnly();

  /*

    Get the sender name/Email for selected message from search result.

    @param messageIndex - The index of message.

    @return Sender name/Email String.

  */
  String getFrom(uint16_t messageIndex);

  /*

    Get the sender name/Email charactor encoding.

    @param messageIndex - The index of message.

    @return Sender name/Email charactor encoding which use for decoding.

  */
  String getFromCharset(uint16_t messageIndex);

  /*

    Get the recipient name/Email for selected message index from search result.

    @param messageIndex - The index of message.

    @return Recipient name/Email String.

  */
  String getTo(uint16_t messageIndex);

  /*

    Get the recipient name/Email charactor encoding.

    @param messageIndex - The index of message.

    @return Recipient name/Email charactor encoding which use in decoding to local language.

  */
  String getToCharset(uint16_t messageIndex);

  /*

    Get the CC name/Email for selected message index of IMAPData result.

    @param messageIndex - The index of message.

    @return CC name/Email String.

  */
  String getCC(uint16_t messageIndex);

  /*

    Get the CC name/Email charactor encoding.

    @param messageIndex - The index of message.

    @return CC name/Email charactor encoding which use in decoding to local language.

  */
  String getCCCharset(uint16_t messageIndex);

  /*

    Get the message subject for selected message index from search result.

    @param messageIndex - The index of message.

    @return Message subject name/Email String.

  */
  String getSubject(uint16_t messageIndex);

  /*

    Get the message subject charactor encoding.

    @param messageIndex - The index of message.

    @return Message subject charactor encoding which use in decoding to local language.

  */
  String getSubjectCharset(uint16_t messageIndex);

  /*

    Get the html message for selected message index from search result.

    @param messageIndex - The index of message.

    @return The html message String or empty String upon the setHTMLMessage was set.

  */
  String getHTMLMessage(uint16_t messageIndex);

  /*

    Get the plain text message for selected message index from search result.

    @param messageIndex - The index of message.

    @return The plain text message String or empty String upon the setTextMessage was set.

  */
  String getTextMessage(uint16_t messageIndex);

  /*

    Get the html message charactor encoding.

    @param messageIndex - The index of message.

    @return Html message charactor encoding which use in decoding to local language.

  */
  String getHTMLMessgaeCharset(uint16_t messageIndex);

  /*

    Get the text message charactor encoding.

    @param messageIndex - The index of message.

    @return The text message charactor encoding which use in decoding to local language.

  */
  String getTextMessgaeCharset(uint16_t messageIndex);

  /*

    Get the date of received message for selected message index from search result.

    @param messageIndex - The index of message.

    @return The date String.

  */
  String getDate(uint16_t messageIndex);

  /*

    Get the message UID for selected message index from search result.

    @param messageIndex - The index of message.

    @return UID String that can be use in setFetchUID.

  */
  String getUID(uint16_t messageIndex);

  /*

    Get the message number for selected message index from search result.

    @param messageIndex - The index of message.

    @return The message number which vary upon search criteria and sorting.

  */
  String getNumber(uint16_t messageIndex);

  /*

    Get the message ID for selected message index from search result.

    @param messageIndex - The index of message.

    @return The message ID String.

  */
  String getMessageID(uint16_t messageIndex);

  /*

    Get the accept language for selected message index from search result.

    @param messageIndex - The index of message.

    @return The accept language String.

  */
  String getAcceptLanguage(uint16_t messageIndex);

  /*

    Get the content language of text or html for selected message index from search result.

    @param messageIndex - The index of message.

