arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.h
    @return The content language String.

  */
  String getContentLanguage(uint16_t messageIndex);

  /*

    Determine fetch error status for selected message index from search result.

    @param messageIndex - The index of message.

    @return Fetch error status.

  */
  bool isFetchMessageFailed(uint16_t messageIndex);

  /*
    Get fetch error reason for selected message index from search result.

    @param messageIndex - The index of message.

    @return Fetch error reason String for selected message index.

  */
  String getFetchMessageFailedReason(uint16_t messageIndex);

  /*
    Determine the attachment download error for selected message index from search result.

    @param messageIndex - The index of message.

    @return Fetch status.

  */
  bool isDownloadAttachmentFailed(uint16_t messageIndex, size_t attachmentIndex);

  /*

    Get the attachment download error reason for selected message index from search result.

    @param messageIndex - The index of message.

    @return Download error reason String for selected message index.

  */
  String getDownloadAttachmentFailedReason(uint16_t messageIndex, size_t attachmentIndex);

  /*

    Determine the downloaded/saved text message error status for selected message index from search result.

    @param messageIndex - The index of message.

    @return Text message download status.

  */
  bool isDownloadMessageFailed(uint16_t messageIndex);

  /*

    Get the attachment or message downloadeds error reason for selected message index from search result.

    @param messageIndex - The index of message.

    @return Downloaded error reason String for selected message index.

  */
  String getDownloadMessageFailedReason(uint16_t messageIndex);

  /*

    Assign the download and decode flags for html message download.

    @param download - Boolean flag to enable/disable message download.

    @param decoded - Boolean flag to enable/disable html message decoding (support utf8 and base64 encoding).

  */
  void saveHTMLMessage(bool download, bool decoded);

  /*

    Assign the download and decode flags for plain text message download.

    @param download - Boolean flag to enable/disable message download.

    @param decoded - Boolean flag to enable/disable plain text message decoding (support utf8 and base64 encoding).

  */
  void saveTextMessage(bool download, bool decoded);

  /*

    Determine the mailbox folder count.

    @return Folder count number.

  */
  uint16_t getFolderCount();

  /*
    Get the mailbox folder name at selected index.

    @param folderIndex - Index of folder.

    @return Folder name String.

    Use folder name from this function for fetch or search.

  */
  String getFolder(uint16_t folderIndex);

  /*

    Determin the number of supported flags count.

    @return Flag count number.

  */
  uint16_t getFlagCount();

  /*
    Get the flag name for selected index.

    @param folderIndex - Index of folder.

    @return Flag name String.

    Use flags from this function for fetch or search.

    */
  String getFlag(uint16_t flagIndex);

  /*

    Get the number of message in selected mailbox folder.

    @return Total message number.

  */
  size_t totalMessages();

  /*

    Get the number of message from search result.

    @return Search result number.

  */
  size_t searchCount();

  /*

    Get the number of message available from search result which less than search limit.

    @return Available message number.

  */
  size_t availableMessages();

  /*

    Get the number of attachments for selected message index from search result.

    @param messageIndex - Index of message.

    @return Number of attachments

  */
  size_t getAttachmentCount(uint16_t messageIndex);

  /*

    Get file name of attachment for selected attachment index and message index from search result.

    @param messageIndex - Index of message.
    @param attachmentIndex - Index of attachment.

    @return The attachment file name String at the selected index.

  */
  String getAttachmentFileName(size_t messageIndex, size_t attachmentIndex);

  /*

    Get the name of attachment for selected attachment index and message index from search result.

    @param messageIndex - Index of message.
    @param attachmentIndex - Index of attachment.

    @return The attachment name String at the selected index.

  */
  String getAttachmentName(size_t messageIndex, size_t attachmentIndex);

  /*

    Get attachment file size for selected attachment index and message index from search result.

    @param messageIndex - Index of message.
    @param attachmentIndex - Index of attachment.

    @return The attachment file size in byte at the selected index.

  */
  int getAttachmentFileSize(size_t messageIndex, size_t attachmentIndex);

  /*

    Get creation date of attachment for selected attachment index and message index from search result.

    @param messageIndex - Index of message.
    @param attachmentIndex - Index of attachment.

    @return The attachment creation date String at the selected index.

  */
  String getAttachmentCreationDate(size_t messageIndex, size_t attachmentIndex);

  /*
    Get attachment file type for selected attachment index and message index from search result.

    @param messageIndex - Index of message.
    @param attachmentIndex - Index of attachment.

    @return File MIME String at the selected index e.g. image/jpeg.

  */
  String getAttachmentType(size_t messageIndex, size_t attachmentIndex);

  /*

    Clear all IMAPData object data.

  */
  void empty();

  /*

    Clear IMAPData object message data.

  */
  void clearMessageData();

  friend ESP32_MailClient;

private:
  String getMessage(uint16_t messageIndex, bool htmlFormat);


  size_t _totalMessage = 0;
  std::string _host = "";
  uint16_t _port = 993;
  uint8_t _storageType = 1;
  FS *fsp = &SD;
  bool _unseen = false;
  std::string _loginEmail = "";
  std::string _loginPassword = "";
  std::string _currentFolder = "INBOX";
  std::string _nextUID = "";
  std::string _searchCriteria = "ALL*";
  std::string _fetchUID = "";
  std::string _savePath = "";

  bool _downloadAttachment = false;
  bool _recentSort = true;
  bool _htmlFormat = false;
  bool _textFormat = false;
  bool _headerOnly = true;
  bool _uidSearch = false;
  bool _saveHTMLMsg = false;
  bool _saveTextMsg = false;
  bool _saveDecodedHTML = false;
  bool _saveDecodedText = false;
  bool _downloadReport = false;
  bool _headerSaved = false;

  size_t _message_buffer_size = 200;
  size_t _attacement_max_size = 1024 * 1024;
  uint16_t _emailNumMax = 20;
  int _searchCount;
  bool _starttls = false;
  bool _debug = false;
  readStatusCallback _readCallback = NULL;

  std::vector<std::string> _date = std::vector<std::string>();
  std::vector<std::string> _subject = std::vector<std::string>();
  std::vector<std::string> _subject_charset = std::vector<std::string>();
  std::vector<std::string> _from = std::vector<std::string>();
  std::vector<std::string> _from_charset = std::vector<std::string>();
  std::vector<std::string> _to = std::vector<std::string>();
  std::vector<std::string> _to_charset = std::vector<std::string>();
  std::vector<std::string> _cc = std::vector<std::string>();
  std::vector<std::string> _cc_charset = std::vector<std::string>();
  std::vector<uint32_t> _msgNum = std::vector<uint32_t>();
  std::vector<std::string> _msgID = std::vector<std::string>();
  std::vector<std::string> _contentLanguage = std::vector<std::string>();
  std::vector<std::string> _acceptLanguage = std::vector<std::string>();

