arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.h
  std::vector<std::string> _folders = std::vector<std::string>();
  std::vector<std::string> _flag = std::vector<std::string>();
  std::vector<int> _attachmentCount = std::vector<int>();
  std::vector<std::vector<messageBodyData>> _messageDataInfo = std::vector<std::vector<messageBodyData>>();
  std::vector<int> _totalAttachFileSize = std::vector<int>();
  std::vector<int> _downloadedByte = std::vector<int>();
  std::vector<int> _messageDataCount = std::vector<int>();
  std::vector<std::string> _errorMsg = std::vector<std::string>();
  std::vector<bool> _error = std::vector<bool>();
  std::vector<const char *> _rootCA = std::vector<const char *>();


  std::unique_ptr<ESP32MailHTTPClient> _net = std::unique_ptr<ESP32MailHTTPClient>(new ESP32MailHTTPClient());

  ReadStatus _cbData;
};

class SMTPData
{
public:
  SMTPData();
  ~SMTPData();

  /*

    Set SMTP server login credentials

    @param host - SMTP server e.g. smtp.gmail.com
    @param port - SMTP port.
    @param loginEmail - The account Email.
    @param loginPassword - The account password.
    @rootCA - Root CA certificate base64 string

    */
  void setLogin(const String &host, uint16_t port, const String &loginEmail, const String &loginPassword, const char *rootCA);
  void setLogin(const String &host, uint16_t port, const String &loginEmail, const String &loginPassword);

  /*

    Set STARTTLS mode to enable STARTTLS protocol

     @param starttls - bool flag that enables STARTTLS mode

  */
  void setSTARTTLS(bool starttls);

   /*

    Set debug print to serial

     @param debug - bool flag to enable debug

  */
  void setDebug(bool debug);
  /*

    Set Sender info

     @param fromName - Sender's name
     @param senderEmail - Sender's Email.

  */
  void setSender(const String &fromName, const String &senderEmail);

  /*

    Get Sender's name

    @return Sender's name String.

  */
  String getFromName();

  /*

    Get Sender's Email

    @return Sender's Email String.

  */
  String getSenderEmail();

  /*

    Set Email priority or importance

    @param priority - Number from 1 to 5, 1 for highest, 3 for normal and 5 for lowest priority

  */
  void setPriority(int priority);

  /*

    Set Email priority or importance

    @param priority - String (High, Normal or Low)

  */
  void setPriority(const String &priority);

  /*

    Get Email priority

    @return number represents Email priority (1 for highest, 3 for normal, 5 for low priority).

  */
  uint8_t getPriority();

  /*

    Add one or more recipient

    @param email - Recipient Email String of one recipient.

    To add multiple recipients, call addRecipient for each recipient.

  */
  void addRecipient(const String &email);

  /*

    Remove recipient

    @param email - Recipient Email String.

  */
  void removeRecipient(const String &email);

  /*

    Remove recipient

    @param index - Index of recipients in Email object that previously added.

  */
  void removeRecipient(uint8_t index);

  /*
    Clear all recipients.
    */
  void clearRecipient();

  /*

    Get one recipient

    @param index - Index of recipients.

    @return Recipient Email String at the index.

  */
  String getRecipient(uint8_t index);

  /*

    Get number of recipients

    @return Number of recipients.

  */
  uint8_t recipientCount();

  /*

    Set the Email subject

    @param subject - The subject.

  */
  void setSubject(const String &subject);

  /*

    Get the Email subject

    @return Subject String.

  */
  String getSubject();

  /*

    Set the Email message

    @param message - The message can be in normal text or html format.
    @param htmlFormat - The html format flag, True for send the message as html format

  */
  void setMessage(const String &message, bool htmlFormat);

  void clrMessage(bool htmlFormat);

  void addMessage(const String &message);


  /*

    Get the message

    @return Message String.

  */
  String getMessage();

  /*

    Determine  message is being send in html format

    @return Boolean status.

  */
  bool htmlFormat();

  /*

    Add Carbon Copy (CC) Email

    @param email - The CC Email String.

  */
  void addCC(const String &email);

  /*

    Remove specified Carbon Copy (CC) Email

    @param email - The CC Email String to remove.

  */
  void removeCC(const String &email);

  /*

    Remove specified Carbon Copy (CC) Email

    @param index - The CC Email index to remove.

  */
  void removeCC(uint8_t index);

  /*

    Clear all Carbon Copy (CC) Emails

  */
  void clearCC();

  /*

    Get Carbon Copy (CC) Email at specified index

    @param index - The CC Email index to get.
    @return The CC Email string at the index.

  */
  String getCC(uint8_t index);

  /*

    Get the number of Carbon Copy (CC) Email

    @return Number of CC Emails.

  */
  uint8_t ccCount();

  /*
    Add Blind Carbon Copy (BCC) Email

    @param email - The BCC Email String.

  */
  void addBCC(const String &email);

  /*

    Remove specified Blind Carbon Copy (BCC) Email

    @param email - The BCC Email String to remove.

  */
  void removeBCC(const String &email);

  /*

    Remove specified Blind Carbon Copy (BCC) Email

    @param index - The BCC Email index to remove.

  */
  void removeBCC(uint8_t index);

  /*

    Clear all Blind Carbon Copy (BCC) Emails

  */
  void clearBCC();

  /*

    Get Blind Carbon Copy (BCC) Email at specified index

    @param index - The BCC Email index to get.

    @return The BCC Email string at the index.

  */
  String getBCC(uint8_t index);

  /*

    Get the number of Blind Carbon Copy (BCC) Email

    @return Number of BCC Emails.

  */
  uint8_t bccCount();

  /*

    Add attchement data (binary) from internal memory (flash or ram)

    @param fileName - The file name String that recipient can be saved.
    @param mimeType - The MIME type of file (image/jpeg, image/png, text/plain...). Can be empty String.
    @param data - The byte array of data (uint8_t)
    @param size - The data length in byte.

  */
  void addAttachData(const String &fileName, const String &mimeType, uint8_t *data, size_t size);

