arendst/Tasmota/lib/libesp32/ESP32-Mail-Client/src/ESP32_MailClient.h
  /*

    Remove specified attachment data

    @param fileName - The file name of the attachment data to remove.

  */
  void removeAttachData(const String &fileName);

  /*

    Remove specified attachment data

    @param index - The index of the attachment data (count only data type attachment) to remove.

  */
  void removeAttachData(uint8_t index);

  /*

    Get the number of attachment data

    @return Number of attach data.

  */
  uint8_t attachDataCount();

  /*

    Add attchement file from SD card

    @param fileName - The file name String that recipient can be saved.
    @param mimeType - The MIME type of file (image/jpeg, image/png, text/plain...). Can be omitted.

  */
  void addAttachFile(const String &filePath, const String &mimeType = "");

  /*

    Remove specified attachment file from Email object

    @param fileName - The file name of the attachment file to remove.

  */
  void removeAttachFile(const String &filePath);

  /*

    Remove specified attachment file

    @param index - The index of the attachment file (count only file type attachment) to remove.

  */
  void removeAttachFile(uint8_t index);

  /*

    Set storage type for all attach files.

    @param storageType - The storage type to read attach file, MailClientStorageType::SD or MailClientStorageType::SPIFFS

  */
  void setFileStorageType(uint8_t storageType);

  /*

    Clear all attachment data

  */
  void clearAttachData();

  /*

    Clear all attachment file.

  */
  void clearAttachFile();

  /*

    Clear all attachments (both data and file type attachments).

  */
  void clearAttachment();

  /*

    Get number of attachments (both data and file type attachments).

    @return Number of all attachemnts.

  */
  uint8_t attachFileCount();

  /*

    Add one or more custom message header field.

    @param field - custom header String inform of FIELD: VALUE

    This header field will add to message header.


  */
  void addCustomMessageHeader(const String &field);

  /*

    Remove one custom message header field that previously added.

    @param field - custom custom message header field String to remove.


  */
  void removeCustomMessageHeader(const String &field);

  /*

    Remove one custom message header field that previously added by its index.

    @param index - custom message header field index (number) to remove.


  */
  void removeCustomMessageHeader(uint8_t index);

  /*

    Clear all ccustom message header field that previously added.

  */
  void clearCustomMessageHeader();

  /*

    Get the number of custom message header field that previously added.

    @return Number of custom message header field.

  */
  uint8_t CustomMessageHeaderCount();

  /*

    Get custom message header field that previously added by index

    @param index - The custom message header field index to get.

    @return The custom message header field string at the index.

  */
  String getCustomMessageHeader(uint8_t index);



  /*

    Clear all data from Email object to free memory.

  */
  void empty();

  /*

    Set the Email sending status callback function to Email object.

    @param sendCallback - The callback function that accept the sendStatusCallback param.

  */
  void setSendCallback(sendStatusCallback sendCallback);

  friend ESP32_MailClient;
  friend attachmentData;

protected:
  int _priority = -1;
  string _loginEmail = "";
  string _loginPassword = "";
  string _host = "";
  uint16_t _port = 0;
  uint8_t _storageType = 1;
  FS *fsp = &SD;
  string _fromName = "";
  string _senderEmail = "";
  string _subject = "";
  string _message = "";
  bool _htmlFormat = false;
  bool _starttls = false;
  bool _debug = false;
  sendStatusCallback _sendCallback = NULL;

  std::vector<std::string> _recipient = std::vector<std::string>();
  std::vector<std::string> _customMessageHeader = std::vector<std::string>();
  std::vector<std::string> _cc = std::vector<std::string>();
  std::vector<std::string> _bcc = std::vector<std::string>();
  attachmentData _attach;
  SendStatus _cbData;
  std::vector<const char *> _rootCA = std::vector<const char *>();
  std::unique_ptr<ESP32MailHTTPClient> _net = std::unique_ptr<ESP32MailHTTPClient>(new ESP32MailHTTPClient());

};


static void __attribute__((used)) ESP32MailDebug(const char *msg)
{

  Serial.print(FPSTR("[DEBUG] - "));
  Serial.println(msg);

}

static void __attribute__((used)) ESP32MailDebugLine(const char *msg, bool newline)
{
  if (!newline)
    Serial.print(FPSTR("[DEBUG] - "));

  if (newline)
    Serial.println(msg);
    else
      Serial.print(msg);
}


extern ESP32_MailClient MailClient;

#endif //ESP32

#endif //ESP32_MailClient_H
